{
  "newspapers": {
    "bbc": {
      "rss": "http://feeds.bbci.co.uk/news/rss.xml",
      "link": "http://www.bbc.com/",
      "articles": []
    },
    "breitbart": {
      "link": "http://www.breitbart.com/",
      "articles": [
        {
          "title": "Russia Says No Territory Surrender as Pre-Negotiation Positioning Begins",
          "text": "Marco Rubio and his Russian counterpart Sergei Lavrov have met for talks on the future of the Ukraine war, but even before sitting down, Russia made clear it was approaching things with a hard bargaining mindset.\n\nImages of U.S. Secretary of State Marco Rubio, flanked by America’s Middle East Envoy Steve Witkoff and National Security Advisor Mike Waltz, and sitting opposite Russia’s Foreign Minister Sergei Lavrov and President Putin’s advisor Yuri Ushakov have been published as talks begin on Tuesday morning.\n\nIt is the first high-level talks between the U.S. and Russia since Moscow launched a second invasion of Ukraine nearly three years ago. The talks are taking place at the Al Diriyah Palace in Riyadh, Saudi Arabia, and are being mediated by Saudi Foreign Minister Faisal bin Farhan Al Saud. They are not intended to find answers for the Ukraine War directly but rather to create an environment where, later, the U.S. and Russian Presidents can meet face-to-face for real negotiations.\n\nIndeed, President Putin’s spokesman, Dmitry Peskov, said that from a Russian perspective, the primary purpose of today’s talks is “restoring the whole complex of Russian-American relations” and organising a future leader meeting.\n\nDespite the narrow intent of today’s talks, European leaders, including Ukraine, have expressed disquiet at not being invited to attend. Ukraine has vowed to ignore any peace deal agreed over its head, and European leaders held their own “emergency” summit on Monday to discuss what was characterised beforehand as “the challenges posed by Trump.”\n\nAs expected with such major negotiations, both sides started early with their hard bargaining tactic positioning. Russia’s Lavrov, a political survivor who has been Russia’s foreign minister for over 20 years, made clear in comments as he flew to Saudi Arabia on Monday that he would be representing Russia’s worldview on the Ukraine war — itself so alien to most Westerners it might prove a negotiating stumbling block all of its own — and would start talks from a position of Russia surrendering no territory whatsoever, Reuters stated.\n\nLavrov also took the time to nettle European leaders, already reportedly smarting from not being invited to today’s talks, to say there would have been no point asking them to peace talks anyway as their only interest — in his view — is in prolonging the war. Lavrov said: “The European philosophy hasn’t gone anywhere, so I don’t know what they should do at the negotiating table. If they are going to weasel out some cunning ideas about freezing the conflict — while actually intending, as is their custom, nature, and habit — to continue the war, then why should we invite them at all?”.\n\nIn other respects, Russia’s concerns appear to mirror Ukraine’s in that it doesn’t want to see a ‘peace’ used as a pretext to re-arm Ukraine for a later resumption of hostilities, Lavrov said. Ukraine has said for weeks it wants any ceasefire to be permanent, with total deterrence of future Russian aggression, so it doesn’t merely use it as time to rebuild its military for a subsequent re-invasion.\n\nOther hard bargaining positions included Lavrov saying Russia would be entering talks with an expectation that the West would have to answer in some way for supporting the Ukrainian government, which he reminds the official position of the Russian state, is that Kyiv is a “Nazi regime”. Ukraine has committed war crimes “worse than Hitler’s murderers” in the course of their defence against Russia’s invasion, he said. Ukraine also accuses Russia of war crimes.\n\nAs with all negotiations, the discovery of what is genuine and what are bids to gain early leverage awaits.",
          "link": "https://www.breitbart.com/europe/2025/02/18/u-s-russia-talks-begin-moscow-pours-cold-water-on-expectations-says-no-territorial-concessions-in-pre-negotiation-positioning/",
          "published": "2025-02-18T00:00:00"
        },
        {
          "title": "Elon Musk: Democrats Use Taxpayer Funds to Encourage Illegal Migration",
          "text": "Democrats use taxpayer funds to attract millions of illegal immigrants, says Elon Musk, leader of the White House’s Department of Government Efficiency (DOGE).\n\n“The REAL reason so many Democrats are upset about entitlements (social security, medical, etc) fraud investigations is that they are using your taxpayer money as handouts to attract and retain ILLEGAL immigrants. Their future voters. ” Musk tweeted on Feb 17, amid rising Democratic denunciation of his investigations into government waste and waste.\n\n“That’s what it’s all about,” he said, adding “Truth.”\n\nUnder President Joe Biden, Democrats spent at least $30 billion to import roughly nine million migrants, mostly via the southern border.\n\nThat inflow of nine million southern migrants was in addition to the legal inflow of about 1 million migrants per year, plus the inflow of about 1 million blue-collar and white-collar contract workers, via a complex variety of half-hidden visa programs such as the H-1B, J-1, TN, H-2B, and H-2A programs.\n\nMeanwhile, Americans’ birth rates are dropping as more young people scramble to find decent jobs, spouses, and housing, aid Biden’s massive inflow of migrants. In 2024, Americans gave birth to roughly 3.5 million children, as illegal migrants birth to another 400,000 kids who automatically gained U.S. citizenship.\n\nThe pro-migration spending under Biden included $22.6 billion distributed to a wide variety of Democrat-aligned non-profit groups via the Department of Health and Human Services. The funding was unveiled by a group called OpenTheBooks. Much additional funding was distributed via Biden’s pro-migration Department of Homeland Security and his pro-globalism Department of State.\n\nThat inflow is adding more government-dependant, Democratic-voting immigrants to the nation’s voting rolls.\n\nThe Washington Post, the New York Times, the Atlantic, Axios, the Los Angeles Times, and the Wall Street Journal have all admitted that rapid demographic shifts spurred by mass immigration are tilting the nation toward a permanent Democrat political majority.\n\nRELATED — White House Press Secretary Brings the Receipts of Waste Cut by DOGE\n\nThe 2024 election defeat was especially shocking to Democrats because many migrant communities voted for President Donald Trump’s economic policies, which include his curbs on the inflow of wage-cutting migrant workers.\n\nYet Democrats deny they are using the government funding to change the nation’s demographics and politics, even as they freely admit to favoring more migration. “The notion … that we intend to allow illegal immigration is nothing short of preposterous,” Biden’s border chief Alejandro Mayorkas told a Senate hearing in 2024.\n\nInstead, Democrats justify their pro-migration policies with a variety of claims.\n\nMayorkas repeatedly said he favored “equity” between foreign migrants and Americans. His border policy is “all about achieving equity, which is really the core founding principle of our country.”\n\nThe ideological support for migration is often surrounded by contempt for ordinary Americans. For example, pro-migrati0n policies allow the Democrats’ college-graduate progressives to feel good when sneering at the vast majority of ordinary Americans who rely on borders to help govern their own country.\n\n“I’m all for just like, open the f… border,” Ohio activist Kevin Oyakawa allegedly told a journalist in October 2024, adding:\n\nI don’t give a shit about who comes in here — we don’t need Border Patrol. But the issue with even talking about immigration here in Ohio is that it’s a losing issue for Democrats here for no fucking reason other than people’s pure racism.\n\nThe ideological support for more migration is obligatory among Democrats, says Mark Krikorian, director of the Center for Immigration Studies. “De facto open[-borders] immigration is a litmus test issue now on the left,” he told Breitbart News.\n\nDemocrats also claim migration is good for the economy — even though it reduces ordinary Americans’ wages and productivity.\n\nIn 2022, for example, Mayorkas said:\n\nWe look to our partner to the north that has a much more nimble immigration system that can be retooled to the needs at the moment. For example, Canada is in need of 1 million workers and they have agreed that in 2023, they will admit 1.4 million … immigrants to fill that labor need that Canadians themselves cannot. We are stuck in antiquated laws that do not meet our current [business] needs. And they haven’t been working for many, many years.\n\n“Now, more than ever, we’re short of workers,” Senl Chuck Schumer (D-NY) said at a Hill press conference in 2022, adding:\n\nWe have a population that is not reproducing on its own with the same level that it used to. The only way we’re going to have a great future in America is if we welcome and embrace immigrants, the dreamers and all of them — because our ultimate goal is to help the Dreamers [illegals who were brought in by their parents] get a path to citizenship for all 11 million — or however many undocumented there are here [emphasis added].\n\nThe inflow of migrants is good for major investors and Wall Street because it inflates the stock market by reducing wages, raising rents, boosting consumer sales, and reducing pressure on companies to invest in high-tech workplace machinery.\n\nBut migration is also good for the government. For example, Democratic-aligned bureaucrats in government also profit from the inflow of poor migrants who need welfare and economic support. Similarly, the arrival of new groups of foreign children ensures that Democratic-run schools and their unions can hire additional teachers, translators, and aid workers.\n\nRELATED — “Eat Elon Musk” Sign Displayed as Democrats Freak Out over DOGE Cutting Waste, Fraud\n\nUnsurprisingly, many Democrats — including President candidate Kamala Harris — have repeatedly favored the inflow of more migrants over policies that would help ordinary Americans earn good wages, get married, buy homes, and rear families.\n\nMusk’s own views on migration are complicated but closely match his economic and political self-interests.\n\nMusk favors the continued inflow of lower-wage, mixed-skill H-1B contract workers from India and China, partly because he used them to replace thousands of better-paid Americans at his Tesla factory.\n\nHe also uses hard-working H-1B migrants at his X social media company, where nearly all of them work long hours — with little complaint — in the hope of getting paid with U.S. citizenship from the federal government.\n\nMusk also wants more births because babies become active adventurous adults — but also because they become consumers, and eventually, users of X, Starlink, and Tesla autos. “Honestly, there’s really no time like the present — just have kids,” he told reporters at a Trump rally in 2024. “You won’t be sorry. It’ll work out.”\n\nBut Mayorkas is also against the mass migration of lower-skilled workers into the United States.\n\nIn part, that 2024 opposition to unskilled migration is likely part of his political alignment with Trump — and to Musk’s personal preference for a high-tech, high-trust, semi-libertarian society.\n\nHowever, Musk has not been asked by reporters how his support for more salary-slicing H-1B workers is consistent with his call for skilled Americans to have more children.",
          "link": "https://www.breitbart.com/economy/2025/02/18/elon-musk-democrats-use-the-federal-budget-to-encourage-illegal-migration/",
          "published": "2025-02-18T00:00:00"
        },
        {
          "title": "Netanyahu: Six Live Hostages Coming Saturday, Four Dead Ones Thursday",
          "text": "Israeli Prime Minister Benjamin Netanyahu announced Tuesday that Hamas has agreed to release the six remaining live hostages on Saturday from the first phase of the ceasefire agreement — and four dead hostages on Thursday.\n\nAs of Monday, there were 14 hostages still left to be released under the first phase, out of 70 overall hostages. Six were known to be alive, though it is not yet known which six, or whether the two remaining child hostages — Ariel (5) and Kfir (2) Bibas — were among them. (Hamas claimed Tuesday that the children and their mother are dead; their father, Yarden, was released a few weeks ago.) The remaining 56, living and dead, will be released as part of a second phase of the ceasefire deal, still under negotiation.\n\nThough the original deal for the first phase indicated that the hostage releases would be spread out over seven weeks, with a few being released every week, Netanyahu has sought to press Hamas to release the living hostages faster.\n\nIt would appear he has been successful, through talks with Hamas mediated by the Egyptian government in recent weeks.\n\nIn a statement, Netanyahu’s office said (translated from Hebrew by the Government Press Office):\n\nUnderstandings have been reached in the Cairo negotiations according to which six living first-stage hostages will be released on Saturday. This Thursday, four deceased hostages will be returned to Israel. Pursuant to the agreement, four additional deceased hostages are due to be returned to Israel next week.\n\nNetanyahu has long faced significant domestic political pressure to reach a ceasefire deal, though Hamas was, until recently, the main obstacle to achieving one.\n\nAfter some of the freed hostages returned home from Gaza in recent weeks looking emaciated — so much so that U.S. President Donald Trump said they looked “like Holocaust survivors” — that pressure only increased. Hamas, too, faces additional pressure as a result of its mistreatment of the hostages.\n\nIsrael is reportedly launching negotiations on the second phase of the deal soon.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
          "link": "https://www.breitbart.com/middle-east/2025/02/18/netanyahu-six-live-hostages-coming-saturday-four-dead-ones-thursday/",
          "published": "2025-02-18T00:00:00"
        },
        {
          "title": "Trump Promotes Florida Governor Poll Showing Rep. Byron Donalds Up Big",
          "text": "President Donald Trump shared a poll Monday showing Rep. Byron Donalds (R-FL) far outpacing potential competitors in the 2026 Florida Republican gubernatorial primary.\n\nThe poll results showed Donalds with a massive 27-point lead over his closest competitor, Jeanette Nuñez.\n\nTrump’s Truth Social post sharing the screenshotted tweet from Victory Insights, a Florida polling firm, also included a list of dozens of “Notable Committed Supporters” of Donalds’ run, including prominent Republican powerbrokers and even Trump cabinet members, Treasury Secretary Scott Bessent and Interior Secretary Doug Burgum.\n\nDonalds has not announced his candidacy, although he has long been rumored to eye the top job in Tallahassee. Perhaps more important than the poll results, Trump’s post is a strong signal that Donalds would have Trump’s backing — the most powerful endorsement in Republican politics.\n\nTrump’s post comes amid reports that Florida first lady Casey DeSantis is considering entering politics by running for the seat currently held by her husband Ron, who unsuccessfully challenged Trump in the 2024 Republican primary.\n\nDonalds, a mainstay on cable news, was an active Trump surrogate in 2024, participating in dozens of events and media interviews for the campaign.\n\nTrump appears to appreciate Donalds’ work.\n\nThe Florida congressman was on Trump’s vice president shortlist in 2024. And at Trump’s Inauguration Day indoor parade at Capitol One Arena, Donalds was the only member of Congress to join Trump and his family on stage.\n\n“What a future this one has,” Trump told the crowd regarding Donalds.\n\nDonalds has been active in Congress as well, leading the fight with Sen. Bill Hagerty (R-TN) to impose sanctions on Colombia for refusing to take back its citizens who illegally came to the United States. In May 2024, the pair introduced legislation to force President Joe Biden to use all available detention space for migrants arriving at the United States-Mexico border while streamlining a federal program to make it easier to deport illegal aliens. And in January, Donalds joined legislation to sanction Colombia after the country’s president reportedly denied entry to two planes carrying deported migrants from the U.S.\n\nBradley Jaye is Deputy Political Editor for Breitbart News. Follow him on X/Twitter and Instagram @BradleyAJaye.",
          "link": "https://www.breitbart.com/politics/2025/02/17/trump-promotes-florida-governor-poll-rep-byron-donalds-up/",
          "published": "2025-02-17T00:00:00"
        }
      ]
    },
    "cnn": {
      "rss": "http://rss.cnn.com/rss/edition.rss",
      "link": "http://edition.cnn.com/",
      "articles": [
        {
          "link": "https://www.cnn.com/videos/politics/2023/04/05/maggie-haberman-donald-trump-speech-indictment-reaction-sot-cnntm-vpx.cnn",
          "published": "2023-04-05T13:30:09",
          "title": "Haberman reveals why Trump attacked judge and his family in speech",
          "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
        },
        {
          "link": "https://www.cnn.com/videos/world/2023/04/02/russian-military-blogger-vladlen-tatarsky-killed-cafe-explosion-chance-vpx.cnn",
          "published": "2023-04-04T01:08:44",
          "title": "Video shows moment of deadly explosion at cafe in Russia",
          "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
        },
        {
          "link": "https://www.cnn.com/2023/04/03/politics/chinese-spy-balloon/index.html",
          "published": "2023-04-03T13:38:22",
          "title": "Chinese spy balloon was able to transmit information back to Beijing",
          "text": "Washington CNN —\n\nThe Chinese spy balloon that transited the US earlier this year was able to capture imagery and collect some signals intelligence from US military sites, a source familiar with the matter tells CNN.\n\nThe balloon was able to transmit information back to Beijing in real time, the source said, and the US government still does not know for sure whether the Chinese government could wipe the balloon’s data as it received it. That raises questions about whether there is intelligence the balloon was able to gather that the US still doesn’t know about.\n\nStill, the intelligence community has not been overly concerned about the information the balloon was able to gather, the person said, because it is not much more sophisticated than what Chinese satellites are able to glean as they orbit over similar locations.\n\nA US intelligence official told CNN on Monday that “although analysis of the wreckage of the High Altitude Balloon remains ongoing, thus far, its flight over the United States does not appear to have provided critical new insights to the People’s Republic of China.”\n\nThe US also knew what the balloon’s path would be and was able to protect sensitive sites and censor some signals before the balloon was able to pick them up, officials have said.\n\nAs CNN has reported, the US intelligence community last year developed a method of tracking what it says is a fleet of these Chinese balloons operating across the globe, controlled by the Chinese military.\n\nThe FBI is still examining the balloon, but so far officials have been able to glean additional information about how the device worked, including the algorithms used for the balloon’s software and how it is powered and designed.\n\nCNN has reached out to the National Security Council at the White House and the Pentagon for comment. NBC was first to report on the new intelligence.\n\nVideo Ad Feedback Justin Trudeau on what the world needs to do to handle China's threats 01:33 - Source: CNN Justin Trudeau on what the world needs to do to handle China's threats 01:33\n\nThe balloon first crossed into US airspace over Alaska in late January before passing through Canada and down into Montana, where it hovered for a few days, leading the US to believe it was trying to surveil sensitive military sites, like Malmstrom Air Force Base in Montana. It was eventually shot down by the US off the East Coast on February 4, and the incident further escalated tensions between Washington and Beijing, including the postponement of a diplomatic visit by US Secretary of State Antony Blinken to China.\n\nA senior State Department official said in February that, as the balloon floated across the US, it “was capable of conducting signals intelligence collection operations.”\n\nGen. Glen VanHerck, the commander of US Northern Command and NORAD, said at the time that the US “did not assess” that the balloon “presented a significant collection hazard beyond what already exists in actionable technical means from the Chinese.”\n\nThe surveillance program, which includes a number of similar balloons, is in part run out of the small Chinese province of Hainan, officials told CNN. The US does not know the precise size of the fleet of Chinese surveillance balloons, but sources tell CNN that the program has conducted at least two dozen missions over at least five continents in recent years.\n\nRoughly half a dozen of those flights have been within US airspace, although not necessarily over US territory, according to one official familiar with the intelligence.\n\nChina has maintained that the balloon was actually just a weather balloon thrown off course, and the US has been assessing the possibility that it was not deliberately maneuvered into the continental US by the Chinese government, CNN has reported.\n\nStill, China did maintain some ability to maneuver the balloon, officials believe. And once the balloon was over Montana, China appeared to take advantage of its position to loiter over sensitive sites and try to collect intelligence.\n\nThis story has been updated with additional reporting."
        },
        {
          "link": "https://www.cnn.com/videos/world/2023/04/03/soldiers-russia-ukraine-war-david-mckenzie-pkg-ovn-intl-ldn-vpx.cnn",
          "published": "2023-04-03T12:13:24",
          "title": "‘Scary, cold, hungry and lonely’: Volunteer soldier shares experience on front line",
          "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues"
        }
      ]
    },
    "foxnews": {
      "rss": "http://feeds.foxnews.com/foxnews/latest",
      "link": "http://www.foxnews.com/",
      "articles": []
    },
    "nytimes_frontpage": {
      "rss": "https://rss.nytimes.com/services/xml/rss/nyt/HomePage.xml",
      "link": "https://nytimes.com/",
      "articles": []
    },
    "nytimes_international": {
      "rss": "https://rss.nytimes.com/services/xml/rss/nyt/World.xml",
      "link": "https://nytimes.com/",
      "articles": []
    },
    "theguardian": {
      "rss": "https://www.theguardian.com/uk/rss",
      "link": "https://www.theguardian.com/international",
      "articles": []
    },
    "washingtonpost": {
      "rss": "http://feeds.washingtonpost.com/rss/world",
      "link": "https://www.washingtonpost.com/",
      "articles": []
    },
    "wsj": {
      "rss": "https://feeds.a.dj.com/rss/RSSWorldNews.xml",
      "link": "https://www.wsj.com",
      "articles": []
    }
  }
}